{
  "recipes": [
    {
      "name": "Японський омлет",
      "image": "https://www.thespruceeats.com/thmb/zbSmYsS6khomLqO0A1JwUeC2ZcE=/960x0/filters:no_upscale():max_bytes(150000):strip_icc()/japanese-tamagoyaki-recipe-2031022-hero-01-0a1d1bd24bf94e78873661be4b5c2b13.jpg",
      "shortDesc": "4 eggs1 tbsp soy sauce1 tbsp mirin1 tbsp sugarpinch of saltcooking oil as needed",
      "longDesc": "First, beat your eggs well in a bowl using either a fork, or chopsticks if you are an expert chopstick user.\n\nAdd one tablespoon each of soy sauce, mirin and sugar and a little salt to your mix.\n\nPut a small amount of cooking oil in your pan and bring it up to medium heat. Keep some kitchen roll handy to help keep the pan oiled during cooking.\n\nAdd a small amount of your egg mix into the heated pan. Once the egg has cooked slightly so that the top is still slightly uncooked, push it over to the side of your pan.\n\nAdd a little more oil to the pan using the kitchen roll and add another small amount of the egg mix to your pan. Again, wait for this to cook a little, but before it sets on top. You can then begin to roll the first bit of egg over the mix you just put in the pan until you have a small roll of egg.\n\nContinue adding a small amount of egg while oiling the pan each time in between. As you add more egg and roll it up each time, your egg roll will start getting larger and easier to add new layers. Keep adding the egg in new layers until you have used it all up.\n\nYour tamagoyaki is now finished so remove from the pan and wait to cool before slicing it up into thin pieces with a sharp knife.",
      "category": "Breakfast",
      "id": 1
    },
    {
      "id": 2,
      "name": "Carrot cake",
      "category": "Desserts",
      "image": "https://grandkulinar.ru/uploads/posts/2019-04/1555839821_morkovnyj-tort-s-syrnym-kremom.jpg",
      "shortDesc": "Cake:\n2 cups granulated sugar\n\n1 1/2 cups vegetable oil\n\n4 fresh whole eggs\n\n2 cups pastry flour\n\n2 teaspoons baking soda\n\n1 teaspoon salt\n\n2 teaspoons ground cinnamon\n\n3 cups raw finely ground carrots\n\n4 ounces finely chopped walnuts\n\nFrosting:\n1 1/2 pounds powdered sugar\n\n12 ounces room temperature cream cheese\n\n1 tablespoon vanilla extract\n\n2 ounces room temperature margarine",
      "longDesc": "For the cake:\nPreheat oven to 300 degrees F.\nIn a mixing bowl, mix sugar, vegetable oil, and eggs. In another bowl, sift together flour, baking soda, salt, and cinnamon. Fold dry ingredients into wet mixture and blend well. Fold in carrots and chopped nuts until well blended. Distribute batter evenly into 3 (9-inch) cake layer pans, which have been generously greased. There will be approximately 1 pound 5 ounces of batter per pan. Place in preheated oven and bake for 50 to 60 minutes. Cool layers in pans, for approximately 1 hour. Store layers in pans, inverted, in closed cupboard to prevent drying. Layers must be a minimum of 1 day old.\nTo remove layers from baking pan, turn upside down, tap edge of pan on a hard surface. Center a 9-inch cake circle on top of revolving cake stand. Remove paper from bottom of layer cake. \nFor the frosting: \nIn a suitable bowl of large mixer, place powdered sugar, cream cheese, vanilla, and margarine. Beat at second speed until thoroughly blended. Hold refrigerated and use as needed.\nFor the assembly: \nPlace first layer, bottom side down, at center of cake stand. With a spatula, evenly spread approximately 3 1/2 ounces of frosting on the layer. Center second layer on top of first layer with topside down. Again with a spatula, evenly spread approximately 3 1/2 ounces of frosting on the layer. Center third layer on top of second layer with topside down. Using both hands, press firmly but gently, all layers together to get one firm cake. With spatula, spread remainder of frosting to cover top and sides of cake. Refrigerated until needed. Display on counter or cake stand with a plastic cover.",
      "createDate": "11.02.2018"
    },
    {
      "id": 3,
      "name": "Борщ",
      "category": "Lunch",
      "image": "https://lh3.googleusercontent.com/proxy/2gdfTnH9DdNfZVnMf6DTvMs1mpUszdsZuuxrc_6g8B_mcKyIgesyJ2wriwHtYxLgfCMXKdrfNCsDUKvaEnaeopBwKY09BCMqwGg4AM9dJ0jbJBvAPP8MbehirOCuJ217rOY7fqDBSfMqj4Wdu7d10IwWNT2VVqzb3zPql1NM0Vo",
      "shortDesc": "\nМясо для бульона  — 400-450 Грамм (говядина, свинина, курица) \nКартофель  — 4 Штуки \nЛуковица  — 1 Штука \nМорковь  — 1 Штука \nСвекла  — 3 Штуки \nКапуста  — 1/3-1/2 Штуки \nЧеснок  — 2-3 Зубчиков \nТоматная паста  — 2 Ст. ложки \nУксус  — 1 Ст. ложка Соль, перец, растительное масло  — По вкусу",
      "longDesc": "Для начала необходимо сварить бульон. Мясо вымойте, выложите в кастрюлю и залейте водой. После закипания уберите огонь до минимума и варите до мягкости мяса (время зависит от того, какое именно мясо вы выбрали). Аккуратно достаньте его из бульона после готовности. 3. Бульон при желании процедите. Подсолите по вкусу и выложите нарезанный кубиками картофель. Варите около 10-12 минут. 4. Лук с морковью очистите, измельчите и обжарьте на сковороде с небольшим количеством растительного масла. 5. В кастрюлю с бульоном выложите обжаренные овощи и мелко нашинкованную капусту. 6. На сковороду тем временем налейте еще немного масла и выложите тертую свеклу. Обжарьте пару минут и добавьте уксус. Тушите еще минут 5, а после выложите томатную пасту. Томите на медленном огне еще 5-7 минут. 7. В бульон выложите мясо, предварительно нарезав его порционными кусочками, и свеклу. 8. По вкусу добавьте соль, перец, сахар и чеснок. Варите еще минут 7-10 до готовности картофеля. После снимите с огня, накройте крышкой и оставьте на полчасика настояться. Перед подачей можно добавить зелень и сметану. Приятного аппетита!",
      "createDate": "01.01.1990"
    },
    {
      "id": 4,
      "name": "Матча-Латте",
      "category": "Drink",
      "image": "https://thepioneerwoman.com/wp-content/uploads/2016/11/how-to-make-a-matcha-latte-01.jpg?fit=1999%2C1333",
      "shortDesc": "1 ч. ложка чая матча;\n1/4 стакана воды 80 градусов;\n3/4 стакана горячего молока (180 мл);\nсахар или мед по вкусу.",
      "longDesc": "Сначала готовим слабый матча (усутя) традиционным способом. Нагреваем воду до 80 градусов, либо кипятим и даем ей остыть. Кипяток использовать нельзя, иначе вы испортите порошок матча. Подогреваем чашу горячей водой и насухо вытираем.\n\nматча чай порошок\n\nНасыпаем в чашу порошок и добавляем немного воды, хорошо размешиваем венчиком до однородной массы. Следим, чтобы не было комков на дне и стенках посуды. Затем доливаем оставшуюся воду и хорошо взбиваем часеном до образования пены.\n\nматча чай\n\nВ это же время отдельно нагреваем молоко. Затем наливаем его во французский пресс и взбиваем до получения воздушной пены. Французский пресс взбивает пену не хуже кофемашины.\n\nфранцузский пресс\n\nВ готовый чай добавьте сахар или мед по вкусу. По своему опыту скажу, что с медом матча латте получится более мягким. Наливаем в стакан для латте чай матча, затем аккуратно взбитое молоко, чтобы пена не осела.\n\nматча латте\n\nМожно посыпать для красоты сверху порошком матча. Наш латте готов! Подавайте с сухофруктами или легкими сладостями.",
      "createDate": "23.03.2020"
    },
    {
      "name": "Яичница",
      "image": "https://www.gastronom.ru/binfiles/images/20150610/b9f64766.jpg",
      "shortDesc": "Яйца -- 3шт, Молоко -- 1шт, Сковордка -- 1шт",
      "longDesc": "Разбить яйца и радоваться жизни",
      "category": "Завтрак",
      "id": 5
    }
  ]
}